// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// (friends.length >= 3) ? console.log('Це великий масив, в якому 3 і більше елементи') :
//     (friends.length > 0 && friends.length < 3) ? console.log('Це маленький масив, в якому менше 3-х елементів!') :
//         console.log('Це не масив!');

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log('Це великий масив, в якому 3 і більше елементи');
// } else if (friends.length > 0 && friends.length < 3) {
//     console.log('Це маленький масив, в якому менше 3-х елементів');
// } else {
//     console.log('Це не масив!');
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let x = +prompt('Введіть число 1');
// let y = +prompt('Введіть число 2');
// let z = +prompt('Введіть число 3');
// let mas = [x, y, z];
// let masV = [x, y, z];
// let masVv = masV.sort();
//
// if (x > y && x < z || x < y && x > z) {
//     console.log('Числа які Ви ввели -', mas[0], mas[1], mas[2]);
//     console.log('Числа які Ви ввели впорядковані -', masVv[0], masVv[1], masVv[2]);
//     console.log('Середнім числом є -', x);
//     console.log('Перше число знаходиться між двома іншими');
// } else if (y > x && y < z || y < x && y > z) {
//     console.log('Числа які Ви ввели -', mas[0], mas[1], mas[2]);
//     console.log('Числа які Ви ввели впорядковані -', masVv[0], masVv[1], masVv[2]);
//     console.log('Середнім числом є -', y);
//     console.log('Перше число не знаходиться між двома іншими');
// } else if (z > x && z < y || z < x && z > y) {
//     console.log('Числа які Ви ввели -', mas[0], mas[1], mas[2]);
//     console.log('Числа які Ви ввели впорядковані -', masVv[0], masVv[1], masVv[2]);
//     console.log('Середнім числом є -', z);
//     console.log('Перше число не знаходиться між двома іншими');
// } else if (x === y || x === z || y === z) {
//     console.log('Числа які Ви ввели -', mas[0], mas[1], mas[2]);
//     console.log('Числа які Ви ввели впорядковані -', masVv[0], masVv[1], masVv[2]);
//     console.log('Середнього числа нема - так як є однакові числа');
// } else {
//     console.log('Щось не то)))');
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = +prompt('Введіть число a');
// let b = +prompt('Введіть число b');
// let result;
// (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number = +prompt('Введіть число від -100 до 100');
// let result;
//
// result = (number === 0) ? console.log('Число нуль') :
//     (number >= -100 && number < 0) ? console.log('Число негативне') :
//         (number > 0 && number <= 100) ? console.log('Число позитивне') :
//             console.log('Число не входить у діапазон від -100 до 100');