// Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Введіть хвилину від 0 до 60');
//
// if (time >= 0 && time <= 14) {
//     console.log('Перша чверть')
// } else if (time >= 15 && time <= 29) {
//     console.log('Друга чверть')
// } else if (time >= 30 && time <= 44) {
//     console.log('Третя чверть')
// } else if (time >= 45 && time <= 59) {
//     console.log('Четверта чверть')
// } else {
//     console.log('Введенно некоректні дані!')
// }


// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Введіть день числом');
//
// if (day >= 0 && day <= 10) {
//     console.log('Перша декада')
// } else if (day >= 11 && day <= 20) {
//     console.log('Друга декада')
// } else if (day >= 21 && day <= 31) {
//     console.log('Третя декада')
// } else {
//     console.log('Введенно некоректні дані!')
// }


// У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = confirm('?????');
// if (test) {
//     console.log('Вірно!');
// } else {
//     console.log('НЕ вірно!');
// }

// let test = confirm('?????') ? console.log('Вірно!') : console.log('НЕ вірно!');


// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('Введіть число')
// if (a !== 0) {
//     console.log('Вірно!');
// } else {
//     console.log('НЕ вірно!');
// }


// Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = prompt('Введіть день тижня!');
// switch (day) {
//     case '1':
//         console.log('Понеділок - пари онлайн з університету, домашка, лекція OktenWeb, робота');
//         break;
//     case '2':
//         console.log('Вівторок - пари онлайн з університету, домашка, шахи, робота');
//         break;
//     case '3':
//         console.log('Середа - пари онлайн з університету, домашка, лекція OktenWeb, робота');
//         break;
//     case '4':
//         console.log('Четвер - пари онлайн з університету, домашка, шахи, робота');
//         break;
//     case '5':
//         console.log('Пятниця - пари онлайн з університету, домашка, лекція OktenWeb, робота');
//         break;
//     case '6':
//         console.log('Субота - домашка, робота, відпочинок');
//         break;
//     case '7':
//         console.log('Неділя - домашка, робота, відпочинок, Голос країни');
//         break;
//     default:
//         console.log('Неправильний день тижня!');
// }


// Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = prompt('Введіть рік!');
// let yearV = year % 4;
// if (yearV === 0) {
//     console.log('Високосний')
// } else {
//     console.log('Не високосний');
// }


// Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let xxx = prompt('Яка «офіційна» назва JavaScript?');
// if (xxx === 'ECMAScript') {
//     console.log('Правильно!')
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }