// ЗАВДАННЯ1
// Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

let x = [8, 25, 35, 6, 5, 120, 800, 99, 13, 30];
let result = x[0] + x[1] + x[2] + x[3] + x[4] + x[5] + x[6] + x[7] + x[8] + x[9];
console.log(result);


// ЗАВДАННЯ2
// Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

// let book1 = {
//     title: 'Буквар',
//     str: 150,
//     genre: 'навчальна'
// }


// ЗАВДАННЯ3
// Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book2 = {
//     title: 'Гаррі Потер',
//     str: 850,
//     genre: 'пригодницька',
//     authors: {
//         author1: {
//             surname: Роулінг,
//             name: Джоан
//         },
//         author2: {
//             surname: Паламар,
//             name: Макс
//         }
//     }
// }


// ЗАВДАННЯ4
// Cтворити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book = []
//
// book[0] = {
//     title: 'Гаррі Потер',
//     str: 850,
//     genre: 'пригодницька',
//     authors: {
//         author1: {
//             surname: 'Роулінг',
//             name: 'Джоан'
//         },
//         author2: {
//             surname: 'Паламар',
//             name: 'Макс'
//         }
//     }
// }
//
// book[1] = {
//     title: 'Тіні забутих предків',
//     str: 650,
//     genre: 'фікшн',
//     authors: {
//         author1: {
//             surname: 'Коцюбинський',
//             name: 'Михайло'
//         }
//     }
// }
//
// book[2] = {
//     title: 'Кайдашева сімя',
//     str: 500,
//     genre: 'повість',
//     authors: {
//         author1: {
//             surname: 'Нечуй-Левицький',
//             name: 'Іван'
//         }
//     }
// }
//
// console.log(book[0]);
// console.log(book[1]);
// console.log(book[2]);


// ЗАВДАННЯ5
// Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let height = 23;
// let width = 10;
// let s = height * width;
// console.log(s);


// ЗАВДАННЯ6
// Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let heightC = 10;
// let dC = 4;
// const PI = 3.14159265359;
// let v = PI * Math.pow(dC / 2, 2) * heightC;
// console.log(v);


// ЗАВДАННЯ7
// У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let n = 3;
// let m = 4;
// let k = Math.sqrt((Math.pow (n, 2) + Math.pow (m, 2)));
// console.log(k);
