// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let x = +prompt('Введіть Х');
// let y = +prompt('Введіть Y');
//
// if (x > y) {
//     console.log(x);
// } else if (y > x) {
//     console.log(y);
// } else {
//     console.log('Числа однакові!');
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let number = +prompt('Введіть номер квартири!');
// if (number >= 1 && number <= 20) {
//     console.log('Ваша квартира знаходиться в першому під`їзді');
// } else if (number >= 21 && number <= 48) {
//     console.log('Ваша квартира знаходиться в другому під`їзді');
// } else if (number >= 49 && number <= 90) {
//     console.log('Ваша квартира знаходиться в третьому під`їзді');
// } else {
//     console.log('Нема такої квартири! Вас обманули');
// }


// Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть число!');
// if (number === 10) {
//     console.log('Вірно!');
// } else {
//     console.log('Невірно!');
// }

// let number = +prompt('Введіть число!');
// (number === 10) ?  console.log('Вірно!') : console.log('Невірно!');


// Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = Math;
// if (typeof x === "number") {
//     console.log(1);
// } else if (typeof x === "string") {
//     console.log(2);
// } else if (typeof x === "boolean") {
//     console.log(3);
// } else {
//     console.log(3);
// }


// Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = prompt('Введіть температуру');
// (temp >= 10 && temp <=22) ? console.log('ми йдемо ВЧИТИСЯ') : console.log('сидимо вдома і вчимося ОНЛАЙН');


// За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне

// let game = +prompt('Введіть число!');
// switch (game) {
//     case 1:
//         console.log('Ви виграли квартиру!');
//         break;
//     case 2:
//         console.log('Ви виграли машину!');
//         break;
//     case 3:
//         console.log('Ви виграли телефон!');
//         break;
//     case 4:
//         console.log('Ви виграли путівку в Карпати!');
//         break;
//     case 5:
//         console.log('Ви виграли навчання у Okten!');
//         break;
//     default:
//         console.log('ОУУУ, нажаль Ви нічого не виграли!')
// }