// - Дано натуральное число n. Выведите все числа от 1 до n.

// let num = (n) => {
//     if (n<=9) {
//         for (let i = 1; i <= n; i++) {
//             console.log(i);
//         }
//     } else {
//         console.log('Число не є науральним!')
//     }
// }
// num(11);


// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let foo = (a, b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             console.log(i);
//         }
//     } else if (a > b) {
//         for (let i = a; i >= b; i--) {
//             console.log(i);
//         }
//     } else if (a === b) {
//         console.log('Числа однакові!');
//     } else console.log('Щось не то ввели!');
// }
//
// foo(15, 10);


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:


//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// let foo = (arr, index) => {
//     for (let i = 0; i < arr.length; i++) {
//         if (i === index) {
//             [arr[i], arr[i+1]] = [arr[i+1], arr[i]];
//         }
//     }
//     console.log(arr);
// }
// foo([9,8,0,4], 1);


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:

// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

// let foo = (arr) => {
//     let arrNew = [];
//     let arrNewZ = [];
//     for (let i = 0; i < arr.length; i++) {
//         if (arr[i] > 0) {
//             arrNew.push(arr[i]);
//         } else if (arr[i] === 0) {
//             arrNewZ.push(arr[i]);
//         }
//     }
//     arr=arrNew.concat(arrNewZ);
//     console.log(arr);
// }
// foo([0,0,1,0]);
